tap "fortran-lang/fortran"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "zegervdv/zathura"
# GNU debugger for aarch64-elf cross development
brew "aarch64-elf-gdb"
# XML-based font configuration API for X Windows
brew "fontconfig"
# OpenType text shaping engine
brew "harfbuzz"
# Library to render SVG files using Cairo
brew "librsvg"
# Icons for the GNOME project
brew "adwaita-icon-theme"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# GNU compiler collection
brew "gcc"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Powerful descriptive vector graphics language
brew "asymptote"
# Message bus system, providing inter-application communication
brew "dbus", restart_service: :changed
# Protocol definitions and daemon for D-Bus at-spi
brew "at-spi2-core"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Collection of portable C++ source libraries
brew "boost"
# New way to see and navigate directory trees
brew "broot"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Cross-platform make
brew "cmake"
# Filename encoding conversion tool
brew "convmv"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Duplicate file utility
brew "czkawka"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# Library for Linear and Mixed-Integer Programming
brew "glpk"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Image processing tools collection
brew "graphicsmagick"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Add GitHub support to git on the command-line
brew "hub"
# Configurable static site generator
brew "hugo"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Interior point optimizer
brew "ipopt"
# Lightweight and flexible command-line JSON processor
brew "jq", link: false
# Linear Algebra PACKage
brew "lapack"
# Simple terminal UI for git commands
brew "lazygit"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2@1.7"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Fast and user friendly build system
brew "meson"
# Programs that partition graphs and order matrices
brew "metis"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Suite of Sparse Matrix Software
brew "suite-sparse"
# High-level interpreted language for numerical computing
brew "octave"
# Scientific library for massively parallel optimization
brew "pagmo"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Password manager
brew "pass"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Cross-platform application and UI framework
brew "qt@5"
# File browser
brew "ranger"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Package for graph partitioning, graph clustering, and sparse matrix ordering
brew "scotch"
# Display and control your Android device
brew "scrcpy"
# Cross-shell prompt for astronauts
brew "starship"
# Strong open-source chess engine
brew "stockfish"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Manipulate and query tags on macOS files
brew "tag"
# Terminal multiplexer
brew "tmux"
# Parser generator tool
brew "tree-sitter-cli"
# Markup-based typesetting system
brew "typst"
# File synchronization tool
brew "unison"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fortran Package Manager (fpm)
brew "fortran-lang/fortran/fpm"
# PDF viewer
brew "zegervdv/zathura/zathura", args: ["with-synctex"]
# Poppler backend plugin for zathura
brew "zegervdv/zathura/zathura-pdf-poppler"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Android SDK component
cask "android-platform-tools"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Menu bar manager
cask "jordanbaird-ice"
# Visual diff and merge tool
cask "meld"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Menu bar indicator showing the currently selected space
cask "spaceid"
# Menu bar customization tool
cask "swiftbar"
# Active space menu bar icon
cask "whichspace"
vscode "adriano-markovic.c-cpp-makefile-project"
vscode "akamud.vscode-theme-onedark"
vscode "akamud.vscode-theme-onelight"
vscode "astro-build.astro-vscode"
vscode "catppuccin.catppuccin-vsc"
vscode "coolchyni.beyond-debug"
vscode "enkia.tokyo-night"
vscode "fortran-lang.linter-gfortran"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "james-yu.latex-workshop"
vscode "janisdd.vscode-edit-csv"
vscode "jeff-hykin.better-cpp-syntax"
vscode "mathworks.language-matlab"
vscode "mhutchie.git-graph"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.sublime-keybindings"
vscode "myriad-dreamin.tinymist"
vscode "njpwerner.autodocstring"
vscode "nvarner.typst-lsp"
vscode "patricknasralla.tokyo-night-moon"
vscode "streetsidesoftware.code-spell-checker"
vscode "teabyii.ayu"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "vscode-icons-team.vscode-icons"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
